https://www.youtube.com/watch?v=vDj0L0lJkps

pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False)

<h2 style="color:blue"> PIVOT </h2>

In [1]:
import pandas as pd

In [3]:
df = pd.read_excel("Pivot.xlsx")
df

   Test  Names  Eng Marks  Math Marks
0     1  Ahmed         80         100
1     2  Ahmed         75          99
2     3  Ahmed         89          76
3     1    Rob         69          80
4     2    Rob         90          58
5     3    Rob         70          79
6     1   Fran         75          80
7     2   Fran         60          90
8     3   Fran         80          94

In [4]:
df.pivot(index='Test', columns='Names')

      Eng Marks          Math Marks
Names     Ahmed Fran Rob      Ahmed Fran Rob
Test
1            80   75  69        100   80  80
2            75   60  90         99   90  58
3            89   80  70         76   94  79

In [5]:
df.pivot(index='Test', columns='Names', values='Eng Marks')

Names  Ahmed  Fran  Rob
Test
1         80    75   69
2         75    60   90
3         89    80   70

In [6]:
df.pivot(index='Test', columns='Names', values='Math Marks')

Names  Ahmed  Fran  Rob
Test
1        100    80   80
2         99    90   58
3         76    94   79

<h2 style="color:blue"> PIVOT TABLE</h2>

- Pivot table allows you to summarize and aggregate data

In [ ]:
# Average results
df1.pivot_table(index='City', columns='date')

In [ ]:
# default is mean
df1.pivot_table(index='City', columns='date', aggfunc='mean')

# both gives same result ---> mean

df1.pivot_table(index='City', columns='date')
df1.pivot_table(index='City', columns='date', aggfunc='mean')

In [ ]:
# using aggregate function
df1.pivot_table(index='City', columns='date', aggfunc='sum')

In [ ]:
# using count function
df1.pivot_table(index='City', columns='date', aggfunc='count')

In [ ]:
# using count function
df1.pivot_table(index='City', columns='date', margins='True')